In [12]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original data :\n")
df=pd.read_excel("/Users/student/Downloads/marks1.xlsx")
print(df)

Original data :

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.
    Unnamed: 0  Roll No       Name  Eng  Tamil  Maths  Science  Social  Total
0            0      101      fahim   90     95     96       97      98    476
1            1      102       loki   45     78     45       65      67    300
2            2      103  Maithresh   56     78     90       78      45    347
3            3      104    mithali   90     95     76       84      98    443
4            4      105    mathosh   45     78     88       65      67    343
5            5      106      vijay   56     99     90       55      45    345
6            6      107   harshini   90     95     66       90      98    439
7            7      108  madhuryaa   45     78     88       65      67    343
8            8      109       mani   45     78     45       65      67    300
9            9      110     harsha   88     78     89       45      45    345
10          10      111    kumaran   90     95     56       44      34    319
11          11      112   lakshaya   45     67     64       78      67    321
12          12      113    kishore   56     99     99       86      45    385
13          13      114      kutty   78     36     66       90      98    368
14          14      115      kavin   78     36     66       90      98    368

In [13]:
f=df['Name'].str.strip()
f.to_excel("/Users/student/Downloads/marks2.xlsx")

In [14]:
print("\nReplace Value:")
k=df.fillna(method='Pad')
print(k)
print("\n updated list :\n")
k.to_excel("/Users/student/Downloads/marks1.xlsx")

Replace Value:
    Unnamed: 0  Roll No       Name  Eng  Tamil  Maths  Science  Social  Total
0            0      101      fahim   90     95     96       97      98    476
1            1      102       loki   45     78     45       65      67    300
2            2      103  Maithresh   56     78     90       78      45    347
3            3      104    mithali   90     95     76       84      98    443
4            4      105    mathosh   45     78     88       65      67    343
5            5      106      vijay   56     99     90       55      45    345
6            6      107   harshini   90     95     66       90      98    439
7            7      108  madhuryaa   45     78     88       65      67    343
8            8      109       mani   45     78     45       65      67    300
9            9      110     harsha   88     78     89       45      45    345
10          10      111    kumaran   90     95     56       44      34    319
11          11      112   lakshaya   45     67     64       78      67    321
12          12      113    kishore   56     99     99       86      45    385
13          13      114      kutty   78     36     66       90      98    368
14          14      115      kavin   78     36     66       90      98    368

 updated list :

/var/folders/xf/j_sxts057v1_8x_j8ll1m54c0000gp/T/ipykernel_4096/4201453241.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='Pad')

In [15]:
print("\nDrop one Particular column and its Values :\n")
k.drop(["Social"],axis=1,inplace=True)
print(k)
print("\n Updated List:\n")
k.to_excel("/Users/student/Downloads/marks1.xlsx")

Drop one Particular column and its Values :

    Unnamed: 0  Roll No       Name  Eng  Tamil  Maths  Science  Total
0            0      101      fahim   90     95     96       97    476
1            1      102       loki   45     78     45       65    300
2            2      103  Maithresh   56     78     90       78    347
3            3      104    mithali   90     95     76       84    443
4            4      105    mathosh   45     78     88       65    343
5            5      106      vijay   56     99     90       55    345
6            6      107   harshini   90     95     66       90    439
7            7      108  madhuryaa   45     78     88       65    343
8            8      109       mani   45     78     45       65    300
9            9      110     harsha   88     78     89       45    345
10          10      111    kumaran   90     95     56       44    319
11          11      112   lakshaya   45     67     64       78    321
12          12      113    kishore   56     99     99       86    385
13          13      114      kutty   78     36     66       90    368
14          14      115      kavin   78     36     66       90    368

 Updated List:

In [18]:
print("\nDrop NaNrows:\n")
df=pd.read_excel("/Users/student/Downloads/marks(NaN).xlsx")
print(df,"\n")
x=df.dropna()
print(x)
print("\n updated list :\n")
x.to_excel("/Users/student/Downloads/new mark.xlsx")

Drop NaNrows:

    Roll No       Name   Eng  Tamil  Maths  Science  Social  Total
0       101      fahim  90.0   95.0   96.0     97.0    98.0  476.0
1       102       loki  45.0   78.0   45.0     65.0    67.0  300.0
2       103  Maithresh  56.0   78.0   90.0     78.0    45.0  347.0
3       104    mithali  90.0   95.0   76.0     84.0    98.0  443.0
4       105    mathosh  45.0   78.0   88.0     65.0    67.0  343.0
5       106      vijay  56.0   99.0   90.0     55.0    45.0  345.0
6       107   harshini  90.0   95.0   66.0     90.0    98.0  439.0
7       108  madhuryaa  45.0   78.0   88.0     65.0    67.0  343.0
8       109       mani  45.0   78.0   45.0     65.0    67.0  300.0
9       110     harsha  88.0   78.0   89.0     45.0    45.0  345.0
10      111    kumaran  90.0   95.0   56.0     44.0    34.0  319.0
11      112   lakshaya  45.0   67.0   64.0     78.0    67.0  321.0
12      113    kishore  56.0   99.0   99.0     86.0    45.0  385.0
13      114      kutty  78.0   36.0   66.0     90.0    98.0  368.0
14      115      kavin   NaN    NaN    NaN      NaN     NaN    NaN

    Roll No       Name   Eng  Tamil  Maths  Science  Social  Total
0       101      fahim  90.0   95.0   96.0     97.0    98.0  476.0
1       102       loki  45.0   78.0   45.0     65.0    67.0  300.0
2       103  Maithresh  56.0   78.0   90.0     78.0    45.0  347.0
3       104    mithali  90.0   95.0   76.0     84.0    98.0  443.0
4       105    mathosh  45.0   78.0   88.0     65.0    67.0  343.0
5       106      vijay  56.0   99.0   90.0     55.0    45.0  345.0
6       107   harshini  90.0   95.0   66.0     90.0    98.0  439.0
7       108  madhuryaa  45.0   78.0   88.0     65.0    67.0  343.0
8       109       mani  45.0   78.0   45.0     65.0    67.0  300.0
9       110     harsha  88.0   78.0   89.0     45.0    45.0  345.0
10      111    kumaran  90.0   95.0   56.0     44.0    34.0  319.0
11      112   lakshaya  45.0   67.0   64.0     78.0    67.0  321.0
12      113    kishore  56.0   99.0   99.0     86.0    45.0  385.0
13      114      kutty  78.0   36.0   66.0     90.0    98.0  368.0

 updated list :